; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l20_p20_c20_g20)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio16)
	(at-person person3 refugio3)
	(at-person person4 refugio11)
	(at-person person5 refugio6)
	(at-person person6 refugio11)
	(at-person person7 refugio1)
	(at-person person8 refugio3)
	(at-person person9 refugio14)
	(at-person person10 refugio6)
	(at-person person11 refugio3)
	(at-person person12 refugio10)
	(at-person person13 refugio14)
	(at-person person14 refugio5)
	(at-person person15 refugio3)
	(at-person person16 refugio10)
	(at-person person17 refugio19)
	(at-person person18 refugio15)
	(at-person person19 refugio9)
	(at-person person20 refugio2)
)

(:goal (and
	(person-has person2 medicina)
	(person-has person3 medicina)
	(person-has person5 comida)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person8 medicina)
	(person-has person9 medicina)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person12 comida)
	(person-has person12 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
	(person-has person15 comida)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person18 medicina)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person20 comida)
))
)

; plan
1. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 0 of 20
2. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 0 of 20
3. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 0 of 20
4. (leave box20 refugio16 dron1-der dron1 person2 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio16) (free dron1-der) (person-has person2 medicina)
   goals met: 1 of 20
5. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 1 of 20
6. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 1 of 20
7. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 1 of 20
8. (leave box11 refugio11 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio11) (free dron1-izq) (person-has person6 comida)
   goals met: 2 of 20
9. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 2 of 20
10. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 2 of 20
11. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 2 of 20
12. (leave box10 refugio1 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio1) (free dron1-izq) (person-has person7 comida)
   goals met: 3 of 20
13. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 3 of 20
14. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 3 of 20
15. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 3 of 20
16. (move refugio6 refugio19 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio19)
   goals met: 3 of 20
17. (leave box9 refugio19 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio19) (free dron1-izq) (person-has person17 comida)
   goals met: 4 of 20
18. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 4 of 20
19. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 4 of 20
20. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 4 of 20
21. (move refugio6 refugio2 dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 refugio2)
   goals met: 4 of 20
22. (leave box8 refugio2 dron1-izq dron1 person20 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio2) (free dron1-izq) (person-has person20 comida)
   goals met: 5 of 20
23. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 5 of 20
24. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 5 of 20
25. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 5 of 20
26. (leave box7 refugio6 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio6) (free dron1-izq) (person-has person5 comida)
   goals met: 6 of 20
27. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 6 of 20
28. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 6 of 20
29. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 6 of 20
30. (leave box19 refugio6 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio6) (free dron1-der) (person-has person10 medicina)
   goals met: 7 of 20
31. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 7 of 20
32. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 7 of 20
33. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 7 of 20
34. (leave box6 refugio10 dron1-izq dron1 person12 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio10) (free dron1-izq) (person-has person12 comida)
   goals met: 8 of 20
35. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 8 of 20
36. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 8 of 20
37. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 8 of 20
38. (leave box18 refugio10 dron1-der dron1 person12 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio10) (free dron1-der) (person-has person12 medicina)
   goals met: 9 of 20
39. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 9 of 20
40. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 9 of 20
41. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 9 of 20
42. (leave box17 refugio14 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio14) (free dron1-der) (person-has person9 medicina)
   goals met: 10 of 20
43. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 10 of 20
44. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 10 of 20
45. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 10 of 20
46. (leave box5 refugio14 dron1-izq dron1 person13 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio14) (free dron1-izq) (person-has person13 comida)
   goals met: 11 of 20
47. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 11 of 20
48. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 11 of 20
49. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 11 of 20
50. (leave box16 refugio14 dron1-der dron1 person13 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio14) (free dron1-der) (person-has person13 medicina)
   goals met: 12 of 20
51. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 12 of 20
52. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 12 of 20
53. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 12 of 20
54. (leave box15 refugio3 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio3) (free dron1-der) (person-has person3 medicina)
   goals met: 13 of 20
55. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 13 of 20
56. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 13 of 20
57. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 13 of 20
58. (leave box14 refugio3 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 medicina)
   added: (at-box box14 refugio3) (free dron1-der) (person-has person8 medicina)
   goals met: 14 of 20
59. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 14 of 20
60. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 14 of 20
61. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 14 of 20
62. (leave box4 refugio3 dron1-izq dron1 person11 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio3) (free dron1-izq) (person-has person11 comida)
   goals met: 15 of 20
63. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 15 of 20
64. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 15 of 20
65. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 15 of 20
66. (leave box3 refugio3 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio3) (free dron1-izq) (person-has person15 comida)
   goals met: 16 of 20
67. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 16 of 20
68. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 16 of 20
69. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 16 of 20
70. (leave box2 refugio15 dron1-izq dron1 person18 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio15) (free dron1-izq) (person-has person18 comida)
   goals met: 17 of 20
71. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 17 of 20
72. (pick box1 deposito dron1-izq dron1)
   deleted: (at-box box1 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box1)
   goals met: 17 of 20
73. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 17 of 20
74. (move refugio15 refugio9 dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 refugio9)
   goals met: 17 of 20
75. (leave box1 refugio9 dron1-izq dron1 person19 comida)
   deleted: (carrying dron1 dron1-izq box1) (box-has box1 comida)
   added: (at-box box1 refugio9) (free dron1-izq) (person-has person19 comida)
   goals met: 18 of 20
76. (leave box13 refugio9 dron1-der dron1 person19 medicina)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 medicina)
   added: (at-box box13 refugio9) (free dron1-der) (person-has person19 medicina)
   goals met: 19 of 20
77. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 19 of 20
78. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 19 of 20
79. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 19 of 20
80. (leave box12 refugio15 dron1-der dron1 person18 medicina)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 medicina)
   added: (at-box box12 refugio15) (free dron1-der) (person-has person18 medicina)
   goals met: 20 of 20
